app/controllers/foods_controller.rb

  def index
    @user = current_user
    @foods = Food.includes(:user).where(user: @current_user)
---
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 1]]